{
    "projects": [
      {
        "name": "aPaperADay Blog",
        "link": "https://www.apaperaday.com",
        "date": "2019 - Present",
        "short": "I started a blog to read a part of a deep learning paper daily.  It has morphed into a style of 'discovery writing' where I document my process of reading new Deep Learning papers.  The blog has inspired a love for research in me, as I keep up with some of the most cited or newest deep learning papers.  I've looked at a range of topics from Vision to NLP to Regularization. I've enjoyed the foundational papers like BERT and Attention is All You Need, but also even a Graphcore patent on machine learning hardware.",
        "status": "complete",
        "weight": 20,
        "photos": [
          "/static/images/paper.png"
        ]
      },
      {
        "name": "Personal Portfolio",
        "link": "https://github.com/tukavic/personal-portfolio",
        "date": "July 2021",
        "short": "This Website.  I took (with permission) from crearo's public github repo and primarily modified the cards on the projects page, and added an acknowledgements page. Hosted on AWS Elastic Beanstalk.",
        "weight": 5,
        "tags": [
          "Flask",
          "AWS",
          "CSS",
          "HTML"
        ],
        "photos": [
          "/static/images/portfolio.png"
        ]
      }, 
      {
        "name": "Violin Build",
        "link": "_violin-build",
        "date": "2011 - 2013",
        "short": "This was a two year build that started in my summers during college.  It was a full build from scratch that I did by following a book and I'm very happy with how it turned out  I even took lessons on it during my last year of college.",
        "weight": 2,
        "tags": [
          "Hands"
        ],
        "photos": [
          "/static/images/v_p5.jpg"
        ]
      },
      {
        "name": "Apple Health Data Analysis",
        "link": "https://github.com/tukavic/ml-apple-health-vo2max",
        "date": "March 2021",
        "short": "A project inspecting my Apple Health Data, particularly trying to predict Vo2Max based on workouts with ensemble tree based methods.",
        "weight": 6,
        "tags": [
          "SKLearn",
          "RandomForests"
        ],
        "photos": [
          "/static/images/apple_health.png"
        ]
      },
      {
        "name": "Report on Feature Importance",
        "link": "publish/feature_importance",
        "pdf_link": "/static/pdfs/featimp.pdf",
        "date": "May 2021",
        "short": "Some writing I did on describing Feature Importance metrics, including mRMR, Drop Column, Permutation Column and Gini Drop.  Read More to see the report on Github.",
        "weight": 7,
        "tags": [
          "SKLearn",
          "Matplotlib",
          "Pandas"
        ],
        "photos": [
          "/static/images/featimp.png"
        ]
      },
      {
        "name": "Scrape Surfline Cam Rewinds",
        "link": "https://gist.github.com/tukavic/da2238ed28eeb00b97d9acecf29c2076",
        "date": "July 2021",
        "short": "I needed to get the surfline cams downloaded, and the open-source code was broken, so I wrote a Selenium script to grab the needed data.",
        "weight": 5,
        "tags": [
          "Selenium"
        ],
        "photos": [
          "/static/images/rewind.png"
        ]
      },
      {
        "name": "8 Bit Computer",
        "link": "https://github.com/tukavic/Computer-Project/tree/master",
        "date": "Oct 2019 - May 2020",
        "short": "This was a computer architecture project I had a blast creating! I built a bare level machine that loaded constants into both registers, added, stored, recalled, then passed those bits to the output lines.",
        "weight": 4,
        "tags": [
          "GreenPak",
          "Arduino",
          "I2C"
        ],
        "photos": [
          "/static/images/breadboard.png"
        ]
      }, 
      {
        "name": "Card Classifier",
        "link": "_card_classifier",
        "date": "Dec 2019",
        "short": "The Card Classifier is a deep learning project as a proof of concept for machine vision. Below you can see the classifications across a fanned deck of cards.  Images are transformed down to (360,200), run through a ResNet-50 backbone and classified into  1 of 53 classes, where the additional class is just a background class.",
        "weight": 5,
        "tags": [
          "FastAI",
          "Matplotlib"
        ],
        "photos": [
          "/static/images/cards_maybe.gif"
        ]
      },
      {
        "name": "SF Citywatch Startup",
        "link": "http://www.sfcitywatch.com",
        "date": "June 2021",
        "short": "A VC pitched project through the Masters of Data Science Program at University of San Francisco, promoting true safety and surrounding awareness through trending crime analysis",
        "weight": 15,
        "tags": [
          "Flask",
          "Docker",
          "AWS",
          "PostGres"
        ],
        "photos": [
          "/static/images/sfcitywatch.png"
        ]
      }
    ]
}


